package _19_12_2024;

public class T3 {

    /**
     * 1. Напишите метод, который принимает массив целых чисел и возвращает его длину.
     */
    public static int getArrayLength(int[] array) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 2. Напишите метод, который принимает массив целых чисел и выводит его элементы в консоль.
     */
    public static void printArray(int[] array) {
        // TODO: реализовать метод
    }

    /**
     * 3. Напишите метод, который принимает массив целых чисел и возвращает сумму его элементов.
     */
    public static int sumArrayElements(int[] array) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 4. Напишите метод, который принимает массив целых чисел и возвращает максимальный элемент.
     */
    public static int findMaxElement(int[] array) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 5. Напишите метод, который принимает массив целых чисел и возвращает минимальный элемент.
     */
    public static int findMinElement(int[] array) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 6. Напишите метод, который принимает массив целых чисел и возвращает
     * новый массив, содержащий только чётные элементы.
     */
    public static int[] filterEvenNumbers(int[] array) {
        // TODO: реализовать метод
        return new int[0];
    }

    /**
     * 7. Напишите метод, который принимает массив целых чисел и
     * возвращает массив в обратном порядке.
     */
    public static int[] reverseArray(int[] array) {
        // TODO: реализовать метод
        return new int[0];
    }

    /**
     * 8. Напишите метод, который принимает массив целых чисел и возвращает true,
     * если массив отсортирован по возрастанию.
     */
    public static boolean isArraySorted(int[] array) {
        // TODO: реализовать метод
        return false;
    }

    /**
     * 9. Напишите метод, который принимает массив целых чисел и возвращает
     * среднее арифметическое его элементов.
     */
    public static double calculateAverage(int[] array) {
        // TODO: реализовать метод
        return 0.0;
    }

    /**
     * 10. Напишите метод, который принимает массив целых чисел и
     * возвращает количество чётных чисел в массиве.
     */
    public static int countEvenNumbers(int[] array) {
        // TODO: реализовать метод
        return 0;
    }


        public static void main(String[] args) {

            System.out.print("1 Задача: ");
            System.out.println(getArrayLength(3, 5));

            System.out.print("2 Задача: ");
            System.out.println(printArray(5, 3));

            System.out.print("3 Задача: ");
            System.out.println(sumArrayElements(5, 3));

            System.out.print("4 Задача: ");
            System.out.println(findMaxElement(6, 3));

            System.out.print("5 Задача: ");
            System.out.println(findMinElement(5));

            System.out.print("6 Задача: ");
            System.out.println(filterEvenNumbers(5, 6, 8));

            System.out.print("7 Задача: ");
            System.out.println(reverseArray(5, 6));

            System.out.print("8 Задача: ");
            System.out.println(isArraySorted(10, 6));

            System.out.print("9 Задача: ");
            System.out.println(calculateAverage(5, 2));

            System.out.print("10 Задача: ");
            System.out.println(countEvenNumbers(8));


        }
        // Пример вызовов методов (после их реализации)
        // int[] exampleArray = {1, 2, 3, 4, 5};
        // System.out.println(getArrayLength(exampleArray));
    }

